MENU_SCREEN = '''
==========================================
    👾 Welcome to the Tic Tac Toe Board  👾 
==========================================
    [1] For Single Player (vs Computer)
    [2] For 2 Players

    [3] Show score board
    
    [0] to Exit Game
'''

SCORE_BOARD = '''
==========================================
            🎖️ Score Board 🎖️
==========================================
    RANK    |   USERNAME    |   SCORE
    
    #🥇            AAA1          SCORE1
    #🥈            AAA2          SCORE2
    #🥉            AAA3          SCORE3
    #4             AAA4          SCORE4
    #5             AAA5          SCORE5

'''


DRAW = '''
=====================================================================
                       🥶 Draw! No winner ! 
=====================================================================
'''

PC_WIN = '''
=====================================================================
                     🥲 You lost in 0 steps! 
=====================================================================
'''

PLAYER_WIN = '''
=====================================================================
  🏆 Congrats! The winner is PLAYER in 0 steps with a score of 999
=====================================================================
'''

SELECT_CHOICE = '''
🤔 PLAYER it is your Turn [TICTOE]
Select one of the following choices
Choices  👉: ALL_CHOICE
____________________

'''

BOARD = '''

      ————————————————————
      |   | 1  |  2 |  3 |
      ————————————————————
      | A | A1 | A2 | A3 |
      ————————————————————
      | B | B1 | B2 | B3 |
      ————————————————————
      | C | C1 | C2 | C3 |
      ————————————————————
'''

THINKING = {
    '1': '🤔 Hummm ',
    '2': '🧐 Wait for my next move ',
    '3': '🤨 Let\'s see what you did here ',
    '4': '🤖 01011000 01001111 ',
    '5': '👾 Watch out for this move ',
    '6': '🧠 I am not chat GPT but I can do something ',
    '7': '👀 ',
}
